In [1]:
import pandas as pd
data_url = 'https://andybek.com/pandas-soccer'
players = pd.read_csv(data_url)
players.head(n=2)

,name,club,age,position,position_cat,market_value,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
0,Alexis Sanchez,Arsenal,28,LW,1,65.0,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0
1,Mesut Ozil,Arsenal,28,AM,1,50.0,4395,9.5,5.60%,167,2,Germany,0,4,1,1,0

1. From our players dataframe remove rows labeled 2, 10 21 and the market_value columns. Do not modify the underlying dataframe. Assign the result to df2

In [30]:
players.shape

(465, 17)

In [32]:
df2 = players.drop(columns=['market_value'])
df2 = df2.drop(index=[2,10,21])

df2.head(n=1)

,name,club,age,position,position_cat,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
0,Alexis Sanchez,Arsenal,28,LW,1,4329,12.0,17.10%,264,3,Chile,0,4,1,1,0

In [33]:
df2.shape

(462, 16)

Does the nationality column in df2 contain any na values? How many unique nationalities are there?

In [39]:
df2.loc[df2.isna().values]

,name,club,age,position,position_cat,page_views,fpl_value,fpl_sel,fpl_points,region,nationality,new_foreign,age_cat,club_id,big_club,new_signing
30,Granit Xhaka,Arsenal,24,NaN,2,1815,5.5,2.00%,85,2,Switzerland,0,2,1,1,0

In [45]:
len(df2.nationality.unique())

61

3. Starting from df2, isolate a datafram slice of players that contains only the unique age-position conbination for each club. Do not include the club column itself.

In [51]:
df2.iloc[:,2:4].drop_duplicates()

     age position
0     28       LW
1     28       AM
3     28       RW
4     31       CB
5     22       RB
..   ...      ...
424   37       CB
434   29       RB
439   18       RW
445   27       RW
462   23       RB

[170 rows x 2 columns]